Revit 2027 API
Gradient.GradientNoiseAmount Property
 The property labeled "Amount" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GradientNoiseAmount { get; }
Public Shared ReadOnly Property GradientNoiseAmount As String
	Get
public:
static property String^ GradientNoiseAmount {
	String^ get ();
}
static member GradientNoiseAmount : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
Gradient Class
Autodesk.Revit.DB.Visual Namespace